CREATE TABLE public.d_allowed (
	allowed_id int8 NOT NULL,
	allowed_code varchar NOT NULL,
	allowed_anno varchar(128) NOT NULL,
	CONSTRAINT allowed_id_pk_1 PRIMARY KEY (allowed_id),
	CONSTRAINT d_allowed_un_1 UNIQUE (allowed_code)
);

-- Column comments

COMMENT ON COLUMN public.d_allowed_1.allowed_id IS 'Идентификатор вида разрешенного использования';
COMMENT ON COLUMN public.d_allowed_1.allowed_code IS 'Код вида разрешенного использования';
COMMENT ON COLUMN public.d_allowed_1.allowed_anno IS 'Описание вида разрешенного использования';

INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214001000000,'214001000000','Сельскохозяйственное использование'),
	 (214001001000,'214001001000','Растениеводство'),
	 (214001001001,'214001001001','Выращивание зерновых и иных сельскохозяйственных культур'),
	 (214001001002,'214001001002','Овощеводство'),
	 (214001001003,'214001001003','Выращивание тонизирующих, лекарственных, цветочных культур'),
	 (214001001004,'214001001004','Садоводство'),
	 (214001001005,'214001001005','Выращивание льна и конопли'),
	 (214001001006,'214001001006','Виноградарство'),
	 (214001002000,'214001002000','Животноводство'),
	 (214001002001,'214001002001','Скотоводство');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214001002002,'214001002002','Звероводство'),
	 (214001002003,'214001002003','Птицеводство'),
	 (214001002004,'214001002004','Свиноводство'),
	 (214001003000,'214001003000','Пчеловодство'),
	 (214001004000,'214001004000','Рыбоводство'),
	 (214001005000,'214001005000','Научное обеспечение сельского хозяйства'),
	 (214001006000,'214001006000','Хранение и переработка сельскохозяйственной продукции'),
	 (214001007000,'214001007000','Ведение личного подсобного хозяйства на полевых участках'),
	 (214001008000,'214001008000','Питомники'),
	 (214001009000,'214001009000','Обеспечение сельскохозяйственного производства');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214001010000,'214001010000','Сенокошение'),
	 (214001011000,'214001011000','Выпас сельскохозяйственных животных'),
	 (214002000000,'214002000000','Жилая застройка'),
	 (214002001000,'214002001000','Для индивидуального жилищного строительства'),
	 (214002001001,'214002001001','Малоэтажная многоквартирная жилая застройка'),
	 (214002002000,'214002002000','Для ведения личного подсобного хозяйства (приусадебный земельный участок)'),
	 (214002003000,'214002003000','Блокированная жилая застройка'),
	 (214002004000,'214002004000','Передвижное жилье'),
	 (214002005000,'214002005000','Среднеэтажная жилая застройка'),
	 (214002006000,'214002006000','Многоэтажная жилая застройка (высотная застройка)');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214002007000,'214002007000','Обслуживание жилой застройки'),
	 (214002007001,'214002007001','Хранение автотранспорта'),
	 (214002007002,'214002007002','Размещение гаражей для собственных нужд'),
	 (214003000000,'214003000000','Общественное использование объектов капитального строительства'),
	 (214003001000,'214003001000','Коммунальное обслуживание'),
	 (214003001001,'214003001001','Предоставление коммунальных услуг'),
	 (214003001002,'214003001002','Административные здания организаций, обеспечивающих предоставление коммунальных услуг'),
	 (214003002000,'214003002000','Социальное обслуживание'),
	 (214003002001,'214003002001','Дома социального обслуживания'),
	 (214003002002,'214003002002','Оказание социальной помощи населению');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214003002003,'214003002003','Оказание услуг связи'),
	 (214003002004,'214003002004','Общежития'),
	 (214003003000,'214003003000','Бытовое обслуживание'),
	 (214003004000,'214003004000','Здравоохранение'),
	 (214003004001,'214003004001','Амбулаторно-поликлиническое обслуживание'),
	 (214003004002,'214003004002','Стационарное медицинское обслуживание'),
	 (214003004003,'214003004003','Медицинские организации особого назначения'),
	 (214003005000,'214003005000','Образование и просвещение'),
	 (214003005001,'214003005001','Дошкольное, начальное и среднее общее образование'),
	 (214003005002,'214003005002','Среднее и высшее профессиональное образование');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214003006000,'214003006000','Культурное развитие'),
	 (214003006001,'214003006001','Объекты культурно-досуговой деятельности'),
	 (214003006002,'214003006002','Парки культуры и отдыха'),
	 (214003006003,'214003006003','Цирки и зверинцы'),
	 (214003007000,'214003007000','Религиозное использование'),
	 (214003007001,'214003007001','Осуществление религиозных обрядов'),
	 (214003007002,'214003007002','Религиозное управление и образование'),
	 (214003008000,'214003008000','Общественное управление'),
	 (214003008001,'214003008001','Государственное управление'),
	 (214003008002,'214003008002','Представительская деятельность');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214003009000,'214003009000','Обеспечение научной деятельности'),
	 (214003009001,'214003009001','Обеспечение деятельности в области гидрометеорологии и смежных с ней областях'),
	 (214003009002,'214003009002','Проведение научных исследований'),
	 (214003009003,'214003009003','Проведение научных испытаний'),
	 (214003010000,'214003010000','Ветеринарное обслуживание'),
	 (214003010001,'214003010001','Амбулаторное ветеринарное обслуживание'),
	 (214003010002,'214003010002','Приюты для животных'),
	 (214004000000,'214004000000','Предпринимательство'),
	 (214004001000,'214004001000','Деловое управление'),
	 (214004002000,'214004002000','Объекты торговли (торговые центры, торгово-развлекательные центры (комплексы)');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214004003000,'214004003000','Рынки'),
	 (214004004000,'214004004000','Магазины'),
	 (214004005000,'214004005000','Банковская и страховая деятельность'),
	 (214004006000,'214004006000','Общественное питание'),
	 (214004007000,'214004007000','Гостиничное обслуживание'),
	 (214004008000,'214004008000','Развлечения'),
	 (214004008001,'214004008001','Развлекательные мероприятия'),
	 (214004008002,'214004008002','Проведение азартных игр'),
	 (214004008003,'214004008003','Проведение азартных игр в игорных зонах'),
	 (214004009000,'214004009000','Служебные гаражи');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214004009001,'214004009001','Объекты дорожного сервиса'),
	 (214004009111,'214004009111','Заправка транспортных средств'),
	 (214004009112,'214004009112','Обеспечение дорожного отдыха'),
	 (214004009113,'214004009113','Автомобильные мойки'),
	 (214004009114,'214004009114','Ремонт автомобилей'),
	 (214004010000,'214004010000','Выставочно-ярмарочная деятельность'),
	 (214005000000,'214005000000','Отдых (рекреация)'),
	 (214005001000,'214005001000','Спорт'),
	 (214005001001,'214005001001','Обеспечение спортивно-зрелищных мероприятий'),
	 (214005001002,'214005001002','Обеспечение занятий спортом в помещениях');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214005001003,'214005001003','Площадки для занятий спортом'),
	 (214005001004,'214005001004','Оборудованные площадки для занятий спортом'),
	 (214005001005,'214005001005','Водный спорт'),
	 (214005001006,'214005001006','Авиационный спорт'),
	 (214005001007,'214005001007','Спортивные базы'),
	 (214005002000,'214005002000','Природно-познавательный туризм'),
	 (214005002001,'214005002001','Туристическое обслуживание'),
	 (214005003000,'214005003000','Охота и рыбалка'),
	 (214005004000,'214005004000','Причалы для маломерных судов'),
	 (214005005000,'214005005000','Поля для гольфа или конных прогулок');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214006000000,'214006000000','Производственная деятельность'),
	 (214006001000,'214006001000','Недропользование'),
	 (214006002000,'214006002000','Тяжелая промышленность'),
	 (214006002001,'214006002001','Автомобилестроительная промышленность'),
	 (214006003000,'214006003000','Легкая промышленность'),
	 (214006003001,'214006003001','Фармацевтическая промышленность'),
	 (214006004000,'214006004000','Пищевая промышленность'),
	 (214006005000,'214006005000','Нефтехимическая промышленность'),
	 (214006006000,'214006006000','Строительная промышленность'),
	 (214006007000,'214006007000','Энергетика');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214006007001,'214006007001','Атомная энергетика'),
	 (214006008000,'214006008000','Связь'),
	 (214006009000,'214006009000','Склады'),
	 (214006009001,'214006009001','Складские площадки'),
	 (214006011000,'214006011000','Целлюлозно-бумажная промышленность'),
	 (214006012000,'214006012000','Научно-производственная деятельность'),
	 (214007000000,'214007000000','Обеспечение космической деятельности'),
	 (214008000000,'214008000000','Транспорт'),
	 (214008001000,'214008001000','Железнодорожный транспорт'),
	 (214008001001,'214008001001','Железнодорожные пути');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214008001002,'214008001002','Обслуживание железнодорожных перевозок'),
	 (214008002000,'214008002000','Автомобильный транспорт'),
	 (214008002001,'214008002001','Размещение автомобильных дорог'),
	 (214008002002,'214008002002','Обслуживание перевозок пассажиров'),
	 (214008002003,'214008002003','Стоянки транспорта общего пользования'),
	 (214008003000,'214008003000','Водный транспорт'),
	 (214008004000,'214008004000','Воздушный транспорт'),
	 (214008005000,'214008005000','Трубопроводный транспорт'),
	 (214008006000,'214008006000','Внеуличный транспорт'),
	 (214009000000,'214009000000','Обеспечение обороны и безопасности');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214010000000,'214010000000','Обеспечение вооруженных сил'),
	 (214011000000,'214011000000','Охрана Государственной границы Российской Федерации'),
	 (214012000000,'214012000000','Обеспечение внутреннего правопорядка'),
	 (214013000000,'214013000000','Обеспечение деятельности по исполнению наказаний'),
	 (214014000000,'214014000000','Деятельность по особой охране и изучению природы'),
	 (214015000000,'214015000000','Охрана природных территорий'),
	 (214015001000,'214015001000','Сохранение и репродукция редких и (или) находящихся под угрозой исчезновения видов животных'),
	 (214016000000,'214016000000','Курортная деятельность'),
	 (214016001000,'214016001000','Санаторная деятельность'),
	 (214017000000,'214017000000','Историко-культурная деятельность');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214018000000,'214018000000','Использование лесов'),
	 (214018001000,'214018001000','Заготовка древесины'),
	 (214018002000,'214018002000','Лесные плантации'),
	 (214018003000,'214018003000','Заготовка лесных ресурсов'),
	 (214018004000,'214018004000','Резервные леса'),
	 (214019000000,'214019000000','Водные объекты'),
	 (214020000000,'214020000000','Общее пользование водными объектами'),
	 (214021000000,'214021000000','Специальное пользование водными объектами'),
	 (214022000000,'214022000000','Гидротехнические сооружения'),
	 (214023000000,'214023000000','Земельные участки (территории) общего пользования');
INSERT INTO public.d_allowed (allowed_id,allowed_code,allowed_anno) VALUES
	 (214023001000,'214023001000','Улично-дорожная сеть'),
	 (214023002000,'214023002000','Благоустройство территории'),
	 (214024000000,'214024000000','Ритуальная деятельность'),
	 (214025000000,'214025000000','Специальная деятельность'),
	 (214026000000,'214026000000','Запас'),
	 (214027000000,'214027000000','Земельные участки общего назначения'),
	 (214027001000,'214027001000','Ведение огородничества'),
	 (214027002000,'214027002000','Ведение садоводства'),
	 (214027003000,'214027003000','Ведение дачного хозяйства'),
	 (0,'000000000000','Не определено');
