INSERT INTO public.d_floor (floor_id,floor_code,floor_anno) VALUES
	 (0,'0','Цокольный'),
	 (1,'1','Первый'),
	 (2,'2','Второй'),
	 (3,'3','Третий'),
	 (4,'4','Четвертый'),
	 (5,'5','Пятый'),
	 (6,'6','Шестой'),
	 (7,'7','Седьмой'),
	 (8,'8','Восьмой'),
	 (9,'9','Девятый');
INSERT INTO public.d_floor (floor_id,floor_code,floor_anno) VALUES
	 (10,'10','Десятый'),
	 (11,'11','Одиннадцатый'),
	 (12,'12','Двенадцатый'),
	 (13,'13','Тринадцатый'),
	 (14,'14','Четырнадцатый'),
	 (15,'15','Пятнадцатый'),
	 (16,'16','Шестнадцатый'),
	 (17,'17','Семнадцатый'),
	 (18,'18','Восемнадцатый'),
	 (19,'19','Девятнадцатый');
INSERT INTO public.d_floor (floor_id,floor_code,floor_anno) VALUES
	 (20,'20','Двадцатый'),
	 (-3,'−3','Третий подземный уровень'),
	 (-2,'−2','Второй подземный уровень'),
	 (-1,'−1','Первый подземный уровень, подвал'),
	 (-999,'','Не определен');
