INSERT INTO public.d_realty (realty_id,realty_code,realty_anno) VALUES
	 (2001001000,'002001001000','Земельный участок'),
	 (2001002000,'002001002000','Здание'),
	 (2001003000,'002001003000','Помещение'),
	 (2001004000,'002001004000','Сооружение'),
	 (2001005000,'002001005000','Объект незавершённого строительства'),
	 (2001006000,'002001006000','Предприятие как имущественный комплекс'),
	 (2001008000,'002001008000','Единый недвижимый комплекс'),
	 (2001009000,'002001009000','Машино-место'),
	 (2001010000,'002001010000','Иной объект недвижимости');
