INSERT INTO public.d_walls (wall_id,wall_code,wall_anno) VALUES
	 (61001000000,'061001000000','Стены'),
	 (61001001000,'061001001000','Каменные'),
	 (61001001001,'061001001001','Кирпичные'),
	 (61001001002,'061001001002','Кирпичные облегченные'),
	 (61001001003,'061001001003','Из природного камня'),
	 (61001002000,'061001002000','Деревянные'),
	 (61001002001,'061001002001','Рубленые'),
	 (61001002002,'061001002002','Каркасно-засыпные'),
	 (61001002003,'061001002003','Каркасно-обшивные'),
	 (61001002004,'061001002004','Сборно-щитовые');
INSERT INTO public.d_walls (wall_id,wall_code,wall_anno) VALUES
	 (61001002005,'061001002005','Дощатые'),
	 (61001002006,'061001002006','Деревянный каркас без обшивки'),
	 (61001003000,'061001003000','Смешанные'),
	 (61001003001,'061001003001','Каменные и деревянные'),
	 (61001003002,'061001003002','Каменные и бетонные'),
	 (61001004000,'061001004000','Легкие из местных материалов'),
	 (61001005000,'061001005000','Из прочих материалов'),
	 (61001006000,'061001006000','Бетонные'),
	 (61001006002,'061001006002','Из мелких бетонных блоков'),
	 (61001006003,'061001006003','Из легкобетонных панелей');
INSERT INTO public.d_walls (wall_id,wall_code,wall_anno) VALUES
	 (61001007000,'061001007000','Железобетонные'),
	 (61001007001,'061001007001','Крупнопанельные'),
	 (61001007002,'061001007002','Каркасно-панельные'),
	 (61001007003,'061001007003','Монолитные'),
	 (61001007004,'061001007004','Крупноблочные'),
	 (61001007005,'061001007005','Из унифицированных железобетонных элементов'),
	 (61001007006,'061001007006','Из железобетонных сегментов'),
	 (61001008000,'061001008000','Шлакобетонные'),
	 (61001009000,'061001009000','Металлические'),
	 (61001999000,'061001999000','Иное');
INSERT INTO public.d_walls (wall_id,wall_code,wall_anno) VALUES
	 (61001006001,'061001006001','Монолитные 2');
